20240102092553-switch_expressions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Switch Expressions</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Switch Expressions</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org540482f">1. Switch Expressions</a>
<ul>
<li><a href="#org8b248bb">1.1. Rules</a>
<ul>
<li><a href="#orgd2e0fa4">1.1.1. 1. Return consistent Data Type</a></li>
<li><a href="#org16984f3">1.1.2. 2. Yielding Values</a></li>
<li><a href="#org7d78ebe">1.1.3. 3. Default Branch</a></li>
</ul>
</li>
<li><a href="#orgdd2bec2">1.2. Multiple value Case Statements</a></li>
<li><a href="#org0ecb02b">1.3. <span class="underline">Exam trick</span></a></li>
<li><a href="#orgb1162fa">1.4. <span class="underline">Exam trick</span></a>
<ul>
<li><a href="#org926978b">1.4.1. Does return value</a></li>
<li><a href="#orgd1469ea">1.4.2. Does NOT return value</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org540482f" class="outline-2">
<h2 id="org540482f"><span class="section-number-2">1.</span> Switch Expressions</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Introduced in <b>Java 14</b></li>
</ul>
<p>
A <code>switch expression</code> is a much more compact form of a <a href="20240102090649-switch_statements.html#ID-0526ffdf-bdb1-4f35-a65f-ef29391f84a3">switch statement</a>, capable of <b>returning a value.</b>
</p>

<div class="org-src-container">
<pre class="src src-java">public void printDayOfWeek(int day) {
    var result = switch(day) {
        case 0 -&gt; "Sunday";
        case 1 -&gt; "Monday";
        case 2 -&gt; "Tuesday";
        case 3 -&gt; "Wednesday";
        case 4 -&gt; "Thursday";
        case 5 -&gt; "Friday";
        case 6 -&gt; "Saturday";
        default -&gt; "Invalid Value";
    };
    System.out.print(result);
}
</pre>
</div>

<p>
Each <code>case</code> or <code>default</code> expression requires a <b>semicolon</b> (as well as the <b>assignment</b> itself).
</p>
</div>

<div id="outline-container-org8b248bb" class="outline-3">
<h3 id="org8b248bb"><span class="section-number-3">1.1.</span> Rules</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgd2e0fa4" class="outline-4">
<h4 id="orgd2e0fa4"><span class="section-number-4">1.1.1.</span> 1. Return consistent Data Type</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<b>All of the branches</b> of a <code>switch</code> expression that <b>do not</b> throw an exception must return a <code>consistent data type</code> (if the <code>switch</code> expression returns a value).
</p>

<div class="org-src-container">
<pre class="src src-java">int measurement = 10;
int size = switch(measurement) {
    case 5 -&gt; 1;
    case 10 -&gt; (short)2;
    default -&gt; 5;
    case 20 -&gt; "3"; // DOES NOT COMPILE
    case 40 -&gt; 4L; // DOES NOT COMPILE
    case 50 -&gt; null; // DOES NOT COMPILE
};
</pre>
</div>
</div>
</div>

<div id="outline-container-org16984f3" class="outline-4">
<h4 id="org16984f3"><span class="section-number-4">1.1.2.</span> 2. Yielding Values</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
If the switch expression returns a value, then every branch that <b>isn’t</b> an expression must <code>yield a value</code>.
</p>

<div class="org-src-container">
<pre class="src src-java">int fish = 5;
int length = 12;
var name = switch(fish) {
    case 1 -&gt; "Goldfish";
    case 2 -&gt; { yield "Trout"; }
    case 3 -&gt; {
        if(length &gt; 10)
            yield "Blobfish";
        else
            yield "Green";
    }
    default -&gt; "Swordfish";
};
</pre>
</div>

<p>
The <code>yield</code> keyword is equivalent to a <code>return statement</code> within a switch expression and is used to <b>avoid ambiguity</b> about whether you meant to exit the block or method around the switch expression.
</p>

<p>
<code>Yield</code> statements are <b>required</b> if the switch statement <b>returns a value</b>.
</p>
</div>
</div>

<div id="outline-container-org7d78ebe" class="outline-4">
<h4 id="org7d78ebe"><span class="section-number-4">1.1.3.</span> 3. Default Branch</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
A <code>default</code> branch is required unless <b>all</b> cases are covered or no <b>value</b> is returned.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdd2bec2" class="outline-3">
<h3 id="orgdd2bec2"><span class="section-number-3">1.2.</span> Multiple value Case Statements</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-java">public static String printSeason(int month) throws IllegalStateException {
    return switch(month) {
        case 1, 2, 3 -&gt; "Winter";
        case 4, 5, 6 -&gt; "Spring";
        case 7, 8, 9 -&gt; "Summer";
        case 10, 11, 12 -&gt; "Fall";
        default -&gt; throw new IllegalStateException("Unexpected value: " + month);
    };
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ecb02b" class="outline-3">
<h3 id="org0ecb02b"><span class="section-number-3">1.3.</span> <span class="underline">Exam trick</span></h3>
<div class="outline-text-3" id="text-1-3">
<p>
Unlike a regular <a href="20240102090649-switch_statements.html#ID-0526ffdf-bdb1-4f35-a65f-ef29391f84a3">switch statement</a>, a <b>switch expression</b> can be used with the <a href="20231231131429-assignment_operators.html#ID-32c06110-1f45-4d85-9583-74d13aaa083f">assignment Operator</a> and <b>requires a semicolon</b> when doing so.
</p>

<p>
Furthermore, <code>semicolons</code> are <b>required</b> for <code>case expressions</code> but <b>cannot</b> be used with <code>case blocks</code>:
</p>

<div class="org-src-container">
<pre class="src src-java">var name = switch(fish) {
    case 1 -&gt; "Goldfish" // DOES NOT COMPILE (missing semicolon)
    case 2 -&gt; { yield "Trout"; }; // DOES NOT COMPILE (extra semicolon)
} // DOES NOT COMPILE (missing semicolon)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb1162fa" class="outline-3">
<h3 id="orgb1162fa"><span class="section-number-3">1.4.</span> <span class="underline">Exam trick</span></h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org926978b" class="outline-4">
<h4 id="org926978b"><span class="section-number-4">1.4.1.</span> Does return value</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
A <code>switch expression</code> that <code>returns a value</code> <b>must</b> handle <b>all possible</b> input values.
</p>
</div>
</div>

<div id="outline-container-orgd1469ea" class="outline-4">
<h4 id="orgd1469ea"><span class="section-number-4">1.4.2.</span> Does NOT return value</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
When it does <b>not</b> return a value, it is <code>optional</code>.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
